import matplotlib.pyplot as plt

dimensions = [100, 500, 1000, 5000, 10000, 50000,100000]
linear = [0.000172626, 0.00021008, 0.00120449, 0.0021114, 0.00813212, 0.0385763, 0.0414265] #прямой поиск
binary = [0.000106096, 0.000175065, 0.000614112, 0.00190752, 0.00378164, 0.0194238, 0.0391309] #бинарный поиск
multi = [2.728e-06, 1.158e-06, 2.219e-06, 1.387e-06, 1.498e-06, 2.259e-06, 2.541e-06] #поиск по мэп
bad_hash = [0.000281014, 0.000435405, 0.00119952, 0.00429605, 0.00841395, 0.0404247, 0.0791531] #плохой хеш
good_hash = [0.000259587, 0.000426774, 0.000957986, 0.00430152, 0.00842398, 0.0400265, 0.0771139] #хороший хеш

plt.plot(dimensions, linear, label="Прямой поиск")
plt.plot(dimensions, binary, label="Бинарный поиск")
plt.plot(dimensions, multi, label="Поиск по ключу в multimap")
plt.plot(dimensions, bad_hash, label="Поиск по таблице плохих хешей")
plt.plot(dimensions, good_hash, label="Поиск по таблице хороших хешей")


plt.xlabel("Размер массива")
plt.ylabel("Время поиска")
plt.legend()

plt.show()
