import matplotlib.pyplot as plt

dimensions = [5000, 10000, 50000,100000]
push = [0.000507487, 0.00894987,0.0351056,0.875507,3.53242,49.3116,198.358] # простые вставки
quick = [0.000180074,0.00104004,0.00213141,0.0136764,0.0287318,0.095425,0.204084] # быстрая сортировка
select = [0.000500184,0.0119028,0.0472462,1.20327,4.47305,69.1657,275.279] #сортировка выбором

plt.plot(dimensions, push, label="Сортировка простыми вставками")
plt.plot(dimensions, quick, label="Быстрая сортировка")
plt.plot(dimensions, select, label="Сортировка ввыбором")


plt.xlabel("Размер массива")
plt.ylabel("Время сортировки")
plt.legend()

plt.yscale('log')
plt.show()

